#include<stdio.h>
int main()
{
	/*
	多维数组

		- 二维数组：由多个一维数组组成
		- 三维数组：由多个二维数组组成  int arr[level][row][col]  层, 行, 列

		注意：通过层去查找数据在哪个二维数组，再遍历
	*/
	//一维数组相当于线，二维数组相当于面，三维数组相当于立体图形

	//  定义格式：数据类型 数组名[层][行][列] 
	int map[3][3][3] =
	{
		{
			{1, 2, 3},
			{1, 2, 3},  /*第一层，下标为0*/
			{1, 2, 3},
		},
		{
			{3, 2, 1},
			{3, 2, 1},  /*第二层，下标为1*/
			{3, 2, 1},
		},
		{
			{0, 0, 0},
			{0, 0, 0},  /*第三层，下标为2*/
			{0, 0, 0},
		},

	};

	printf("%d\n", map[2][2][1]);//输出为0
	printf("%d\n", map[0][2][0]);//输出为1

	//遍历三维数组：
	//i j k 分别来控制层行列的循环
	for (int i = 0; i < 3; i++)
	{
		
		for (int j = 0; j < 3; j++)
		{
			
			for (int k = 0; k < 3; k++)
			{
				printf("%d", map[i][j][k]);
			};
			printf("\n");
		};
	};


	return 0;
}